package memo.beans;

import java.util.List;

public class test {
	public static void main(String[] args) throws Exception {
		
//		memberDto mdto = new memberDto();
//		mdto.setId("hee");
//		mdto.setPw("hee");
//		mdto.setPhone("01012341234");
//		memberDao mdao = new memberDao();
//		try {
//			mdao.register(mdto);
//		} catch (Exception e) {
//			e.printStackTrace();
//			System.out.println("중복 회원가입");
//		}
//		
		//이상무
//		memoDto dto = new memoDto();
//		memoDao dao = new memoDao();
//		dto.setId("hee");
//		dto.setDetail("아무거나 입력된 메모 아무거나 입력된 메모 아무거나 입력된 메모 아무거나 입력된 메모 아무거나 입력된 메모 아무거나 입력된 메모 아무거나 입력된 메모 아무거나 입력된 메모 아무거나 입력된 메모 아무거나 입력된 메모 아무거나 입력된 메모 아무거나 입력된 메모 아무거나 입력된 메모 아무거나 입력된 메모 아무거나 입력된 메모 아무거나 입력된 메모 "
//				     +"아무거나 입력된 메모 아무거나 입력된 메모 아무거나 입력된 메모 아무거나 입력된 메모 아무거나 입력된 메모 아무거나 입력된 메모 아무거나 입력된 메모 아무거나 입력된 메모 아무거나 입력된 메모 아무거나 입력된 메모 아무거나 입력된 메모 아무거나 입력된 메모 아무거나 입력된 메모 아무거나 입력된 메모 아무거나 입력된 메모 아무거나 입력된 메모"
//					+"아무거나 입력된 메모 아무거나 입력된 메모 아무거나 입력된 메모 아무거나 입력된 메모 아무거나 입력된 메모 아무거나 입력된 메모 아무거나 입력된 메모 아무거나 입력된 메모 아무거나 입력된 메모 아무거나 입력된 메모 아무거나 입력된 메모 아무거나 입력된 메모 아무거나 입력된 메모 아무거나 입력된 메모 아무거나 입력된 메모 아무거나 입력된 메모 "
//				     +"아무거나 입력된 메모 아무거나 입력된 메모 아무거나 입력된 메모 아무거나 입력된 메모 아무거나 입력된 메모 아무거나 입력된 메모 아무거나 입력된 메모 아무거나 입력된 메모 아무거나 입력된 메모 아무거나 입력된 메모 아무거나 입력된 메모 아무거나 입력된 메모 아무거나 입력된 메모 아무거나 입력된 메모 아무거나 입력된 메모 아무거나 입력된 메모 ");
//		try {
//			dao.write(dto);
//		} catch (Exception e) {
//			e.printStackTrace();
//		}
//		memoDto dto = new memoDto();
//		memoDao dao = new memoDao();
//		dto.setId("hee");
//		dto.setDetail("2아무거나 입력된 메모 아무거나 입력된 메모 아무거나 입력된 메모 아무거나 입력된 메모 아무거나 입력된 메모 아무거나 입력된 메모 아무거나 입력된 메모 아무거나 입력된 메모 아무거나 입력된 메모 아무거나 입력된 메모 아무거나 입력된 메모 아무거나 입력된 메모 아무거나 입력된 메모 아무거나 입력된 메모 아무거나 입력된 메모 아무거나 입력된 메모 "
//				     +"아무거나 입력된 메모 아무거나 입력된 메모 아무거나 입력된 메모 아무거나 입력된 메모 아무거나 입력된 메모 아무거나 입력된 메모 아무거나 입력된 메모 아무거나 입력된 메모 아무거나 입력된 메모 아무거나 입력된 메모 아무거나 입력된 메모 아무거나 입력된 메모 아무거나 입력된 메모 아무거나 입력된 메모 아무거나 입력된 메모 아무거나 입력된 메모"
//					+"아무거나 입력된 메모 아무거나 입력된 메모 아무거나 입력된 메모 아무거나 입력된 메모 아무거나 입력된 메모 아무거나 입력된 메모 아무거나 입력된 메모 아무거나 입력된 메모 아무거나 입력된 메모 아무거나 입력된 메모 아무거나 입력된 메모 아무거나 입력된 메모 아무거나 입력된 메모 아무거나 입력된 메모 아무거나 입력된 메모 아무거나 입력된 메모 "
//				     +"아무거나 입력된 메모 아무거나 입력된 메모 아무거나 입력된 메모 아무거나 입력된 메모 아무거나 입력된 메모 아무거나 입력된 메모 아무거나 입력된 메모 아무거나 입력된 메모 아무거나 입력된 메모 아무거나 입력된 메모 아무거나 입력된 메모 아무거나 입력된 메모 아무거나 입력된 메모 아무거나 입력된 메모 아무거나 입력된 메모 아무거나 입력된 메모 ");
//		try {
//			dao.write(dto);
//		} catch (Exception e) {
//			e.printStackTrace();
//		}
		
		//이상무
//		List<memoDto> list = dao.getList();
//		System.out.println(list.get(0));
//		System.out.println(list.get(1));
		
		
		
		
	}
}
